cmsis-svd/cmsis-svd/data/STMicro/STM32H750.svd
        <register>
          <name>HSEM_ISR</name>
          <displayName>HSEM_ISR</displayName>
          <description>HSEM Interrupt status register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISEM0</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM1</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM2</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM3</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM4</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM5</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM6</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM7</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM8</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM9</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM10</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM11</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM12</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM13</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM14</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM15</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM16</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM17</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM18</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM19</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM20</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM21</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM22</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM23</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM24</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM25</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM26</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM27</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM28</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM29</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM30</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM31</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_MISR</name>
          <displayName>HSEM_MISR</displayName>
          <description>HSEM Masked interrupt status
          register</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISEM0</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM1</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM2</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM3</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM4</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM5</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM6</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM7</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM8</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM9</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM10</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM11</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM12</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM13</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM14</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM15</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM16</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM17</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM18</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM19</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM20</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM21</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM22</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM23</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM24</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM25</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM26</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM27</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM28</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM29</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM30</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISEM31</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_CR</name>
          <displayName>HSEM_CR</displayName>
          <description>HSEM Clear register</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MASTERID</name>
              <description>MasterID of semaphores to be
              cleared</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>KEY</name>
              <description>Semaphore clear Key</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_KEYR</name>
          <displayName>HSEM_KEYR</displayName>
          <description>HSEM Interrupt clear register</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY</name>
              <description>Semaphore Clear Key</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
