cmsis-svd/cmsis-svd/data/STMicro/STM32H750.svd
        <register>
          <name>QUADSPI_ABR</name>
          <displayName>QUADSPI_ABR</displayName>
          <description>QUADSPI alternate bytes
          registers</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ALTERNATE</name>
              <description>Alternate Bytes Optional data to be send
              to the external SPI device right after the address.
              This field can be written only when BUSY =
              0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QUADSPI_DR</name>
          <displayName>QUADSPI_DR</displayName>
          <description>QUADSPI data register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data Data to be sent/received to/from
              the external SPI device. In indirect write mode, data
              written to this register is stored on the FIFO before
              it is sent to the Flash memory during the data phase.
              If the FIFO is too full, a write operation is stalled
              until the FIFO has enough space to accept the amount
              of data being written. In indirect read mode, reading
              this register gives (via the FIFO) the data which was
              received from the Flash memory. If the FIFO does not
              have as many bytes as requested by the read operation
              and if BUSY=1, the read operation is stalled until
              enough data is present or until the transfer is
              complete, whichever happens first. In automatic
              polling mode, this register contains the last data
              read from the Flash memory (without masking). Word,
              halfword, and byte accesses to this register are
              supported. In indirect write mode, a byte write adds
              1 byte to the FIFO, a halfword write 2, and a word
              write 4. Similarly, in indirect read mode, a byte
              read removes 1 byte from the FIFO, a halfword read 2,
              and a word read 4. Accesses in indirect mode must be
              aligned to the bottom of this register: a byte read
              must read DATA[7:0] and a halfword read must read
              DATA[15:0].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QUADSPI_PSMKR</name>
          <displayName>QUADSPI_PSMKR</displayName>
          <description>QUADSPI polling status mask
          register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MASK</name>
              <description>Status mask Mask to be applied to the
              status bytes received in polling mode. For bit n:
              This field can be written only when BUSY =
              0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QUADSPI_PSMAR</name>
          <displayName>QUADSPI_PSMAR</displayName>
          <description>QUADSPI polling status match
          register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MATCH</name>
              <description>Status match Value to be compared with
              the masked status register to get a match. This field
              can be written only when BUSY = 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QUADSPI_PIR</name>
          <displayName>QUADSPI_PIR</displayName>
          <description>QUADSPI polling interval
          register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERVAL</name>
              <description>Polling interval Number of CLK cycles
              between to read during automatic polling phases. This
              field can be written only when BUSY =
              0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QUADSPI_LPTR</name>
          <displayName>QUADSPI_LPTR</displayName>
          <description>QUADSPI low-power timeout
          register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TIMEOUT</name>
              <description>Timeout period After each access in
              memory-mapped mode, the QUADSPI prefetches the
              subsequent bytes and holds these bytes in the FIFO.
              This field indicates how many CLK cycles the QUADSPI
              waits after the FIFO becomes full until it raises
              nCS, putting the Flash memory in a lower-consumption
              state. This field can be written only when BUSY =
              0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
